modm-ext/data.modm.io/docs/svd/header_stm32h743xx.svd
        <register>
          <name>CFG2</name>
          <description>SPI Configuration register 2</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MSSI</name>
              <description>Master SS Idleness</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLENESS_00CYCLE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_01CYCLE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_02CYCLE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_03CYCLE</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_04CYCLE</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_05CYCLE</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_06CYCLE</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_07CYCLE</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_08CYCLE</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_09CYCLE</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_10CYCLE</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_11CYCLE</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_12CYCLE</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_13CYCLE</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_14CYCLE</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_15CYCLE</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIDI</name>
              <description>Master Inter-Data Idleness</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLENESS_00CYCLE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_01CYCLE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_02CYCLE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_03CYCLE</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_04CYCLE</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_05CYCLE</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_06CYCLE</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_07CYCLE</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_08CYCLE</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_09CYCLE</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_10CYCLE</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_11CYCLE</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_12CYCLE</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_13CYCLE</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_14CYCLE</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLENESS_15CYCLE</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOSWP</name>
              <description>Swap functionality of MISO and MOSI pins</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMM</name>
              <description>COMM [1:0]: SPI Communication Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SP</name>
              <description>SP[2:0]: Serial Protocol</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOTOROLA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TI</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTER</name>
              <description>SPI Master</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASTER</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSBFRST</name>
              <description>Data frame format</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSB_FIRST</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSB_FIRST</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Clock Phase</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHASE_1EDGE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHASE_2EDGE</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock Polarity</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSM</name>
              <description>Software slave management</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSIOP</name>
              <description>SS input/output polarity</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSOE</name>
              <description>SS output enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSOM</name>
              <description>SS output management in master mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AFCNTR</name>
              <description>Alternate function GPIOs control</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>SPI/I2S Interrupt Enable register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXPIE</name>
              <description>RXP Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXPIE</name>
              <description>TXP interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXPIE</name>
              <description>DXP interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOTIE</name>
              <description>EOT/SUSP/TXC interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXTFIE</name>
              <description>TXTF interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDRIE</name>
              <description>UDR interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRIE</name>
              <description>OVR interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCEIE</name>
              <description>CRCE interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIFREIE</name>
              <description>TI Frame Error interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODFIE</name>
              <description>MODF interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSERFIE</name>
              <description>TSERF interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SPI/I2S Status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXP</name>
              <description>Rx-Packet available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXP</name>
              <description>Tx-Packet space available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXP</name>
              <description>Duplex Packet available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOT</name>
              <description>Duplex Packet available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXTF</name>
              <description>Transmission Transfer Filled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDR</name>
              <description>UDR at Slave transmission</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR</name>
              <description>Rx-Packet available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCE</name>
              <description>CRC Error Detected</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIFRE</name>
              <description>TI frame format error Detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODF</name>
              <description>Mode Fault Detected</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSERF</name>
              <description>Number of SPI data to be transacted reloaded</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>SUSP is set by hardware</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXC</name>
              <description>TxFIFO transmission complete</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXPLVL</name>
              <description>RxFIFO Packing Level</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_0PACKET</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_1PACKET</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_2PACKET</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_3PACKET</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXWNE</name>
              <description>Rx FIFO Word Not Empty</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTSIZE</name>
              <description>Number of data frames remaining in TSIZE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <description>SPI/I2S Interrupt/Status flags clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EOTC</name>
              <description>End Of Transfer flag clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXTFC</name>
              <description>Transmission Transfer Filled flag clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDRC</name>
              <description>Underrun flag clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRC</name>
              <description>Overrun flag clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCEC</name>
              <description>CRC Error flag clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIFREC</name>
              <description>TI frame format error flag clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODFC</name>
              <description>Mode Fault flag clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSERFC</name>
              <description>TSERFC flag clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPC</name>
              <description>SUSPend flag clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR</name>
          <description>SPI/I2S Transmit data register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDR</name>
          <description>SPI/I2S Receive data register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPOLY</name>
          <description>SPI CRC Polynomial register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCRC</name>
          <description>SPI Transmitter CRC register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXCRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCRC</name>
          <description>SPI Receiver CRC register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXCRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UDRDR</name>
          <description>SPI Underrun data register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UDRDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
